# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.

daynumber = int(input("Введи цифру, дня недели: "))
if (daynumber == 6 or daynumber == 7):
    print("Этот день выходной")
elif daynumber == 1 or (daynumber >1 and daynumber <= 5):
    print("Этот день НЕ выходной")
else: 
    print("Дня недели под таким номером не существует")