# Напишите программу, которая принимает на вход координаты точки (X и Y), 
# причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
# в которой находится эта точка (или на какой оси она находится).

x = int(input("Enter the coordinate X: "))
y = int(input("Enter the coordinate Y: "))

if (x > 0 and y > 0):
    print("Номер четверти = I")
elif (x < 0 and y > 0):
    print("Номер четверти = II")
elif (x < 0 and y < 0):
    print("Номер четверти = III")
elif (x > 0 and y < 0):
    print("Номер четверти = IV")
else:
    print("Координаты введены неверно или не соответствуют условию задачи")